recept/src/Documents/КоррекцияОстатков/КоррекцияОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоррекцияОстатков</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коррекция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
  <enumValues>
    <name>УслугаРазделитель</name>
  </enumValues>
</mdclass:Enum>

recept/src/Documents/КоррекцияОстатков/Forms/ФормаЗагрузкиТаблицыИзExcel/Module.bsl
&НаКлиенте
Процедура Прочитать(Команда)
	ТаблицаДанных.Очистить();
	ПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Таблица.Область());
	Построитель.ЗаполнитьНастройки();
	Построитель.Выполнить();
	Таб = Построитель.Результат.Выгрузить();
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("мДанные", Таб);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мДанные.Наименование КАК Наименование,
		|	мДанные.Партия КАК Партия,
		|	мДанные.Остаток КАК Остаток,
		|	мДанные.Цвет КАК Цвет,
		|	мДанные.RAL КАК RAL
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&мДанные КАК мДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.Наименование КАК Наименование,
		|	ВТ_Данные.Партия КАК Партия,
		|	ВТ_Данные.Остаток КАК Остаток,
		|	ВТ_Данные.Цвет КАК Цвет,
		|	ВТ_Данные.RAL КАК RAL,
		|	ОстаткиМатериаловОстатки.ОстатокОстаток КАК ОстатокВ1С,
		|	ОстаткиМатериаловОстатки.Наименование.Ссылка КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Остатки КАК ОстаткиМатериаловОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Данные КАК ВТ_Данные
		|		ПО ОстаткиМатериаловОстатки.Наименование.Код = ВТ_Данные.Партия
		|ГДЕ
		|	ОстаткиМатериаловОстатки.ОстатокОстаток > 0
		|	И ОстаткиМатериаловОстатки.Наименование.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Продукция)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		нд = ТаблицаДанных.Добавить();
		нд.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		нд.Цвет 		= ВыборкаДетальныеЗаписи.Цвет;
		//нд.RAL  		= ВыборкаДетальныеЗаписи.RAL;
		нд.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		нд.Остаток 		= ВыборкаДетальныеЗаписи.Остаток;
		нд.ОстатокВ1С 	= ВыборкаДетальныеЗаписи.ОстатокВ1С;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ОповеститьОВыборе(ТаблицаДанных);
КонецПроцедуры
